
// 1.0 选择排序 Selection Sort

// 工作原理：开启一个循环，每轮从未排序区间选择最小的元素，将其放到已排序区间的末尾。

void selectionSort(int nums[], int n){
	
	// 外部循环：未排序元素区间为[i, n-1]
	for(int i=0; i<n-1; i++){
		
		// 内层循环：找出为排序区间的最小值
		int k = i;		
		
		for(int j=i+1; j<n; j++)
			
			if(nums[j]<nums[k])
				k = j;		// 使用 k 来记录最小元素的索引
		
		// 将最小元素与未排序元素的首个元素交换
		int temp = nums[i];
		nums[i] = nums[k];
		nums[k] = temp;
		
	}
	
}


// 时间复杂度： O(n^2) 嵌套循环，内外循环有依赖，1:n-1; 2:n-2; 3:n-3 ...... n-1:1; 非自适应循环(未利用自身有序特性)；
// 空间复杂度： O(1)，原地排序，指针 i 和 j 使用常数大小的额外空间；
// 稳定性： 非稳定性算法 2 2 5 3 1; 元素 nums[i] 有可能被交换至与其相等的元素的右边，导致两者的相对顺序发生改变。
// 比较次数固定：n(n-1)/2,  交换次数最多：n-1


/* 大佬总结口诀：

外循环遍历经过起点，内循环遍历起点之后的元素；
最初 i 和 k 初始化一致；之后找到最小元素 j 的位置，就把 j 的值赋给 k；
最后把 k 和 i 的元素与 i 和 k 的元素做交换。
*/

--------------------------------------------------------------------------------------------------------------

// 2.0 冒泡排序 Buble Sort

// 工作原理：通过连续的比较相邻的元素实现排序。从数组的最左端开始向右遍历，
// 依次比较相邻元素的大小，如果 左元素>右元素 则交换左右元素的值。遍历完成之后最大的元素就会被移动到数组的最右端

void bubbleSort(int nums[], int size){
	
	//外部循环：未排序的元素区间 [0, i]	
	for(int = size-1; i>0; i--){
		
		// 内循环：将未排序区间[0,i]中的最大元素交换值该区域的最右端
		for(int j=0; j<i; j++){
			
			if(nums[j]>nums[j+1]){
				
				int temp = nums[j];
				nums[j] = nums[j+1];
				nums[j+1] = temp;
				
			}
		}	
	}
}


// 如果某轮冒泡中没有执行任何交换，说明数组已经排序完成，可直接返回结果

// 新增一个标志位 flag 来监听这种情况，一旦发现立即返回

void bubbleSortWithFlag(int nunms[], int size){

	// 外部循环：未排序区间为 [0, i]
	for(int i=size-1; i>0; i--){
		bool flag = false;
		
		// 内部循环：将未排序空间的最大元素交换到区间最右端
		for(int j=0; j<i; i++){
			if(nums[j]>nums[j+1]){
				int temp = nums[j+1];
				nums[j+1] = nums[j];
				nums[j] = temp;
				flag = true;
			}
		}	
	
		if(!flag) 
			break;
	}
}


// 时间复杂度： O(n^2) 各轮冒泡遍历数组的长度分别是 n-1， n-2 ... 2, 1; 引入 Flag 之后，最佳的时间复杂度为 O(n)
// 空间复杂度： O(1)，原地排序，指针 i 和 j 使用常数大小的额外空间；
// 稳定排序： 由于在“冒泡”中遇到相等元素不交换。


/* 大佬总结口诀：

冒泡排序只有两个指针i、j

i控制外层循环，判断有哪些是还没有排序的，或者说是最后一个还没排序的元素对应的索引，从后往前

j控制内层循环，把从头到最倒数第二个还没排序的元素之间的相邻元素进行大小比较，把较大的元素不断往后移

要注意的是i是不包括索引为0的第一个元素的，因为后面的元素排完以后，第一个元素自然就不用排位置了

而j是不包括索引为i的元素，因为j+1要有意义，故把i当作j+1,则始终有意义

*/

--------------------------------------------------------------------------------------------------------------

